#include <iostream>
using namespace std;

int main(void) {
    double pi4 = 0.0;  // Змінна для зберігання суми дробів
    long n;           // Змінна для кількості ітерацій

    // Запитуємо у користувача кількість ітерацій
    cout << "Number of iterations? ";
    cin >> n;

    // Обчислюємо значення Pi/4 за формулою Лейбница
    for (long i = 0; i < n; i++) {
        // Додаємо або віднімаємо дроби, використовуючи (-1)^i
        pi4 += (i % 2 == 0 ? 1.0 : -1.0) / (2.0 * i + 1);
    }

    // Виводимо значення Pi
    cout.precision(20); // Встановлюємо точність виводу
    cout << "Pi = " << (pi4 * 4.0) << endl;  // Помножуємо на 4, щоб отримати значення Pi
    return 0;
}